test/artillery/contact/testContact.yml
config:
  target: https://patena-api.herokuapp.com
  payload:
    # path relativo a la localización del script de test
    path: "contact.csv"
    fields:
      - "name"
      - "email"
      - "message"
      - "Token"
  phases:
    - duration: 60
      arrivalRate: 25
      name: send message contact
  defaults:
    headers:
      Authorization: 'Bearer {{Token}}'
scenarios:
  - flow:
      - post:
          url: "/contact"
          json:
            name: "{{ name }}"
            email: "{{ email }}"
            message: "{{ message }}"
          headers:
            Authorization: 'Bearer {{Token}}'
            Content-Type: 'application/json'